# Projeto Final - Banco de Dados I

## Relatório elaborado por:  
Eduardo Silva Carvalho - edu.carvalho1989@gmail.com  
Ronaldo Scarpate - rs.quim@gmail.com

_____

## Sobre o dataset

O dataset foi obtido no site data.world e ajustado com processo de normalização.

As informações representam dados de uma empresa (fictícia) de varejo nos EUA.  
Ele inclui informações sobre funcionários, clientes, gerentes, estados, tipos de emprego e vendas.  
As tabelas estão interconectadas por meio de chaves estrangeiras para garantir a integridade dos dados.  
Esses dados fornecem uma visão das operações da empresa, desde o status dos funcionários até as transações de vendas realizadas.

_________

## Código SQL para criação das tabelas

In [ ]:
"""
-- Criar um Schema "ada"
CREATE SCHEMA ada

-- Criar a tabela "employees_clients"
CREATE TABLE ada.employees_clients (
    client_id SERIAL PRIMARY KEY,
    client_name VARCHAR(50) NOT NULL
);

-- Criar a tabela "employees_managers"
CREATE TABLE ada.employees_managers (
    manager_id SERIAL PRIMARY KEY,
    manager_name VARCHAR(50) NOT NULL
);

-- Criar a tabela "employees_states"
CREATE TABLE ada.employees_states (
    state_id SERIAL PRIMARY KEY,
    state VARCHAR(50) NOT NULL
);

-- Criar a tabela "employment_types"
CREATE TABLE ada.employment_types (
    employment_type_id SERIAL PRIMARY KEY,
    employment_type VARCHAR(50) NOT NULL
);

-- Criar a tabela "employees_status"
CREATE TABLE ada.employees_status (
    employee_id INTEGER PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    state_id INTEGER,
    employment_type_id INTEGER,
    manager_id INTEGER,
    employee_since DATE,
    projects INTEGER,
    salary DECIMAL(10, 2),
    bonus DECIMAL(5, 2),
    FOREIGN KEY (state_id) REFERENCES ada.employees_states(state_id),
    FOREIGN KEY (employment_type_id) REFERENCES ada.employment_types(employment_type_id),
    FOREIGN KEY (manager_id) REFERENCES ada.employees_managers(manager_id)
);

-- Criar a tabela "employees_sales"
CREATE TABLE ada.employees_sales (
    operation_id SERIAL PRIMARY KEY,
    employee_id INTEGER,
    client_id INTEGER,
    revenue DECIMAL(10, 2),
    qty_sales INTEGER,
    FOREIGN KEY (employee_id) REFERENCES ada.employees_status(employee_id),
	FOREIGN KEY (client_id) REFERENCES ada.employees_clients(client_id)
);
"""

____

## Código para Importar os arquivos (CSV) para o Bando de Dados

In [ ]:
"""
COPY ada.employees_clients (client_id, client_name) FROM 'D:\Employees_Clients.csv' DELIMITER ',' CSV HEADER;
COPY ada.employees_managers (manager_id, manager_name) FROM 'D:\Employees_Managers.csv' DELIMITER ',' CSV HEADER;
COPY ada.employees_states (state_id, state) FROM 'D:\Employees_States.csv' DELIMITER ',' CSV HEADER;
COPY ada.employment_types (employment_type_id, employment_type) FROM 'D:\Employment_Types.csv' DELIMITER ',' CSV HEADER;
COPY ada.employees_status (employee_id, first_name, last_name, state_id, employment_type_id, manager_id, employee_since, projects, salary, bonus) 
FROM 'D:\Employees_Status.csv' DELIMITER ',' CSV HEADER;
COPY ada.employees_sales (operation_id, employee_id, client_id, revenue, qty_sales) FROM 'D:\Employees_Sales.csv' DELIMITER ',' CSV HEADER;
"""

________________

### Importações das bibliotecas necessárias.

In [10]:
import pandas as pd 
import pandasql as ps
from sqlalchemy import create_engine

### Parâmetros para conexão com o Banco de Dados.

In [18]:
# SGBD://USER:SENHA@HOST/DATABASE

SGBD = "postgresql+psycopg2"
USER = "postgres"
SENHA = "Ada2023"
HOST = "localhost"
DATABASE = "projeto"

engine = create_engine(f"{SGBD}://{USER}:{SENHA}@{HOST}:5433/{DATABASE}")
conn = engine.connect()

_____

## Qual as tipagens das colunas da tabelas? ##

### employees_clients: ###  
**client_id** _(SERIAL PRIMARY KEY):_ Numérica (inteiro).  
**client_name** _(VARCHAR(50) NOT NULL):_ Texto (cadeia de caracteres).  

### employees_managers: ###  
**manager_id** _(SERIAL PRIMARY KEY):_ Numérica (inteiro).  
**manager_name** _(VARCHAR(50) NOT NULL):_ Texto (cadeia de caracteres).  

### employees_states: ###  
**state_id** _(SERIAL PRIMARY KEY):_ Numérica (inteiro).  
**state** _(VARCHAR(50) NOT NULL):_ Texto (cadeia de caracteres).  

### employment_types: ###  
**employment_type_id** _(SERIAL PRIMARY KEY):_ Numérica (inteiro).  
**employment_type** _(VARCHAR(50) NOT NULL):_ Texto (cadeia de caracteres).  

### employees_status: ###  
**employee_id** _(INTEGER PRIMARY KEY):_ Numérica (inteiro).  
**first_name** _(VARCHAR(50)):_ Texto (cadeia de caracteres).  
**last_name** _(VARCHAR(50)):_ Texto (cadeia de caracteres).  
**state_id** _(INTEGER):_ Numérica (inteiro).  
**employment_type_id** _(INTEGER):_ Numérica (inteiro).  
**manager_id** _(INTEGER):_ Numérica (inteiro).  
**employee_since** _(DATE):_ Data.  
**projects** _(INTEGER):_ Numérica (inteiro).  
**salary** _(DECIMAL(10, 2)):_ Numérica (decimal).  
**bonus** _(DECIMAL(5, 2)):_ Numérica (decimal).  

### employees_sales: ###  
**operation_id** _(SERIAL PRIMARY KEY):_ Numérica (inteiro).  
**employee_id** _(INTEGER):_ Numérica (inteiro).  
**client_id** _(INTEGER):_ Numérica (inteiro).  
**revenue** _(DECIMAL(10, 2)):_ Numérica (decimal).  
**qty_sales** _(INTEGER):_ Numérica (inteiro).  INTEGER):_ Numérica (inteiro).

_____________

## Quantos nulos temos em cada coluna? ##

Todas as colunas em todas as tabelas estão livres de valores nulos.  
Inclusive algumas das colunas fazer uso do parâmetro NOT NULL na criação da tabela.

_____________

## Quantos valores únicos temos nas colunas categoricas? ##

### employees_clients: ###  
**client_name:** 741 Valores únicos  

### employees_managers: ###  
**manager_name:** 57 Valores únicos  

### employees_states: ###  
**state:** 50 Valores únicos  

### employment_types: ###  
**employment_type:** 4 Valores únicos  

### employees_status: ###  
**employee_id:** 741 Valores únicos  

### employees_sales: ###  
**operation_id:** 741 Valores únicos  1 Valores únicos

_______________________________

# 10 Perguntas sobre o Dataset

## 01. Qual a média de salário (Salário + Bônus) por tipo de Jornada de Trabalho?

In [19]:
query = """
SELECT
    et.employment_type AS tipo_jornada_trabalho,
    ROUND(AVG(es.salary + (es.salary * es.bonus)), 2) AS media_salario
FROM
    ada.employees_status AS es
JOIN
    ada.employment_types AS et
ON 
    es.employment_type_id = et.employment_type_id
GROUP BY
    et.employment_type
ORDER BY
    media_salario DESC;
"""

pd.read_sql_query(query, con = conn)

  tipo_jornada_trabalho  media_salario
0              Contract       71637.25
1             Full Time       71033.28
2             Half-Time       45329.51
3                Hourly       37551.19

## 02. Qual o número de funcionários por estado?

In [20]:
query = """
SELECT
    est.state,
    COUNT(*) AS numero_funcionarios
FROM
    ada.employees_status AS es
JOIN
    ada.employees_states AS est 
ON 
	es.state_id = est.state_id
GROUP BY
    est.state_id, est.state
ORDER BY
    numero_funcionarios DESC;
"""

pd.read_sql_query(query, con = conn)

             state  numero_funcionarios
0         New York                   38
1         Michigan                   27
2     North Dakota                   26
3            Texas                   24
4         Oklahoma                   18
5       New Jersey                   18
6          Georgia                   16
7     Rhode Island                   15
8          Indiana                   14
9      Connecticut                   14
10        Maryland                   14
11         Alabama                   14
12        Delaware                   14
13         Montana                   14
14        Colorado                   14
15            Iowa                   14
16     Mississippi                   14
17          Kansas                   14
18       Wisconsin                   14
19           Idaho                   14
20   Massachusetts                   14
21         Arizona                   14
22       Minnesota                   14
23  North Carolina                   14
24      California                   14
25            Ohio                   14
26          Nevada                   14
27    South Dakota                   13
28       Tennessee                   13
29  South Carolina                   13
30           Maine                   13
31   New Hampshire                   13
32         Wyoming                   13
33        Illinois                   13
34          Alaska                   13
35    Pennsylvania                   13
36      Washington                   13
37       Louisiana                   13
38          Hawaii                   13
39         Florida                   13
40   West Virginia                   13
41        Kentucky                   13
42         Vermont                   13
43        Missouri                   13
44        Arkansas                   12
45        Virginia                   12
46            Utah                   12
47        Nebraska                   12
48          Oregon                   12
49      New Mexico                   12

## 03. Quais são os 7 estados com a Receita Total mais alta?

In [22]:
query = """
SELECT
    est.state,
    SUM(eas.revenue) AS receita_total
FROM
    ada.employees_status AS es
JOIN
    ada.employees_states AS est
ON
	es.state_id = est.state_id
JOIN
    ada.employees_sales AS eas
ON
	es.employee_id = eas.employee_id
GROUP BY
    es.state_id, est.state
ORDER BY
    receita_total DESC
LIMIT 7;
"""

pd.read_sql_query(query, con = conn)

          state  receita_total
0      New York     9053069.28
1      Michigan     7161846.38
2  North Dakota     6709136.26
3         Texas     5355198.00
4    New Jersey     5140839.76
5      Kentucky     4299526.13
6      Oklahoma     4227708.76

## 04. Quais são os funcionários em que a Receita é menor que o Salário (Salário + Bônus) do funcionário e qual é esta diferença?

In [24]:
query = """
SELECT
    CONCAT(es.first_name, ' ', es.last_name) AS nome_completo,
    ROUND(es.salary + (es.salary * es.bonus), 2) AS salario_total,
    ROUND(SUM(eas.revenue), 2) AS receita_total,
    ROUND(SUM(eas.revenue) - (es.salary + (es.salary * es.bonus)), 2) AS diferenca
FROM
    ada.employees_status AS es
JOIN
    ada.employees_sales AS eas
ON
	es.employee_id = eas.employee_id
GROUP BY
    es.employee_id, nome_completo, salario_total
HAVING
    SUM(eas.revenue) < (es.salary + (es.salary * es.bonus))
ORDER BY
    diferenca;
"""

pd.read_sql_query(query, con = conn)

       nome_completo  salario_total  receita_total  diferenca
0   Geraldo Estrella      117001.33       11328.75 -105672.58
1   Patty Cunningham      114853.20       40950.00  -73903.20
2        Dana Fields       87564.57       17325.00  -70239.57
3     Kandy Laflamme      114544.71       44340.00  -70204.71
4        Leah Harris      112160.41       42108.75  -70051.66
..               ...            ...            ...        ...
66    Dale Alexander       53984.71       50280.00   -3704.71
67     Oliver Watson       43151.54       39926.25   -3225.29
68      Tami Estrada       40335.12       38235.00   -2100.12
69   Lauren Hardacre       74220.30       73001.25   -1219.05
70   Denise Campbell       41771.42       40905.00    -866.42

[71 rows x 4 columns]

## 05. Qual o Nome completo do funcionário que mais ganha por tipo de Jornada de Trabalho?

In [25]:
query = """
SELECT
    CONCAT(es.first_name, ' ', es.last_name) AS nome_completo,
    ROUND(es.salary + (es.salary * es.bonus), 2) AS salario_total,
    et.employment_type AS tipo_jornada_trabalho
FROM
    ada.employees_status AS es
JOIN
    ada.employment_types AS et
ON
	es.employment_type_id = et.employment_type_id
WHERE
    (es.salary + (es.salary * es.bonus)) = (
        SELECT
            MAX(es2.salary + (es2.salary * es2.bonus))
        FROM
            ada.employees_status AS es2
        WHERE
            es2.employment_type_id = es.employment_type_id
    )
ORDER BY
    salario_total DESC;
"""

pd.read_sql_query(query, con = conn)

      nome_completo  salario_total tipo_jornada_trabalho
0    Fernanda Coble      117178.74             Half-Time
1    Wilford Beatty      117131.28             Full Time
2  Geraldo Estrella      117001.33              Contract
3         Hsiu Goad      111116.29                Hourly

## 06. Qual o Nome e Sobrenome do funcionário com mais tempo na Empresa?

In [26]:
query = """
SELECT
    CONCAT(first_name, ' ', last_name) AS nome_completo,
    employee_since AS data_ingresso,
    ROUND((CURRENT_DATE - employee_since) / 365) AS quantidade_anos
FROM
    ada.employees_status
ORDER BY
    data_ingresso DESC
LIMIT 1;
"""

pd.read_sql_query(query, con = conn)

   nome_completo data_ingresso  quantidade_anos
0  Workman Saenz    2016-06-15              7.0

## 07. Quais funcionário e qual o total de Remuneração (Salário + Bônus) que foi pago nos Estados da Califória, Flórida e Texas?

In [28]:
query = """
SELECT
    CONCAT(es.first_name, ' ', es.last_name) AS nome_completo,
    est.state AS estado,
    ROUND((es.salary + (es.salary * es.bonus)), 2) AS total_remuneracao,
    ROUND(
        (SELECT SUM((es2.salary + (es2.salary * es2.bonus)))
        FROM ada.employees_status AS es2
        WHERE est.state_id = es2.state_id), 2
    ) AS subtotal_estado
FROM
    ada.employees_status AS es
JOIN
    ada.employees_states AS est
ON
	es.state_id = est.state_id
WHERE
    est.state IN ('California', 'Texas', 'Florida')
ORDER BY
	estado,
	total_remuneracao DESC;
"""

pd.read_sql_query(query, con = conn)

        nome_completo      estado  total_remuneracao  subtotal_estado
0      Helen Crutcher  California          114639.63        873467.22
1      Willie Jenkins  California          104381.76        873467.22
2       Mindy Coleman  California          103558.56        873467.22
3       Ariane Belvin  California           93379.86        873467.22
4       Serafina Metz  California           81970.90        873467.22
5      Beau Treadwell  California           79764.30        873467.22
6        Alison Alsop  California           63084.96        873467.22
7        Megan Hudson  California           48198.15        873467.22
8      Dennis Mcbride  California           41593.34        873467.22
9         Stella Wong  California           38977.26        873467.22
10         Eric Quinn  California           33615.75        873467.22
11       Howard Cohen  California           31333.05        873467.22
12       Alyson Bloom  California           28576.80        873467.22
13       George Young  California           10392.90        873467.22
14      Alicia Lawson     Florida          103652.64        794609.12
15   Randall Cummings     Florida          100359.84        794609.12
16        Erma Vicini     Florida           97220.48        794609.12
17       Willie Hardy     Florida           78101.10        794609.12
18        Gordon Reid     Florida           62291.16        794609.12
19      Howard Chacon     Florida           60748.92        794609.12
20     George Hubbard     Florida           58456.24        794609.12
21   Babette Crutcher     Florida           52681.45        794609.12
22      Andrea Bailey     Florida           51939.94        794609.12
23      Kenneth Adams     Florida           42472.08        794609.12
24     Susan Anderson     Florida           33207.30        794609.12
25      Retha Tennant     Florida           28301.70        794609.12
26    Natalie Jackson     Florida           25176.27        794609.12
27   Geraldo Estrella       Texas          117001.33       1782241.54
28    Jonathan Abbott       Texas          115968.51       1782241.54
29        Leah Harris       Texas          112160.41       1782241.54
30     Thalia Guevara       Texas          105299.04       1782241.54
31      Libby Morrell       Texas          103147.52       1782241.54
32        Teri Bowers       Texas          102018.56       1782241.54
33        Masa Loomis       Texas           99501.92       1782241.54
34       Betty Wilson       Texas           88147.32       1782241.54
35    Clarence Carson       Texas           85804.11       1782241.54
36    Stewart Headley       Texas           81912.60       1782241.54
37     Leonie Rowland       Texas           81427.50       1782241.54
38     Scott Erickson       Texas           80469.40       1782241.54
39        Erik Saxton       Texas           76935.10       1782241.54
40     Mildred Miller       Texas           75387.40       1782241.54
41        Gloria Hunt       Texas           73134.60       1782241.54
42     Jessica Gibson       Texas           66509.64       1782241.54
43      Alonzo Hansen       Texas           62143.20       1782241.54
44       Blake Newman       Texas           60192.72       1782241.54
45         Sonny Goad       Texas           50602.44       1782241.54
46         Ray Stokes       Texas           47469.98       1782241.54
47      Donna Bennett       Texas           28885.50       1782241.54
48  Fredericka Eckart       Texas           28356.30       1782241.54
49       Harold Perry       Texas           27485.85       1782241.54
50      Erika Andrews       Texas           12280.59       1782241.54

## 08. Quais funcionários que ganham mais de $3,000 de Bônus nos Estados da Califória, Flórida e Texas?

In [29]:
query = """
SELECT
    CONCAT(es.first_name, ' ', es.last_name) AS nome_completo,
    est.state AS estado,
    ROUND((es.salary * es.bonus), 2) AS bonus_total
FROM
    ada.employees_status AS es
JOIN
    ada.employees_states AS est
ON
	es.state_id = est.state_id
WHERE
    est.state IN ('California', 'Texas', 'Florida')
    AND (es.salary * es.bonus) > 3000
ORDER BY
    bonus_total DESC;
"""

pd.read_sql_query(query, con = conn)

       nome_completo      estado  bonus_total
0   Geraldo Estrella       Texas     13460.33
1    Jonathan Abbott       Texas     13341.51
2     Helen Crutcher  California     13188.63
3        Leah Harris       Texas     12903.41
4     Thalia Guevara       Texas     11282.04
5     Willie Jenkins  California     11183.76
6      Alicia Lawson     Florida     11105.64
7      Mindy Coleman  California     11095.56
8      Libby Morrell       Texas     11051.52
9        Teri Bowers       Texas     10930.56
10  Randall Cummings     Florida     10752.84
11       Masa Loomis       Texas     10660.92
12       Erma Vicini     Florida     10416.48
13     Ariane Belvin  California      9253.86
14      Betty Wilson       Texas      8735.32
15   Clarence Carson       Texas      8503.11
16     Serafina Metz  California      7451.90
17   Stewart Headley       Texas      7446.60
18    Leonie Rowland       Texas      7402.50
19    Scott Erickson       Texas      7315.40
20    Beau Treadwell  California      7251.30
21      Willie Hardy     Florida      7100.10
22       Erik Saxton       Texas      6994.10
23    Mildred Miller       Texas      6853.40
24       Gloria Hunt       Texas      6648.60
25    Jessica Gibson       Texas      4926.64
26      Alison Alsop  California      4672.96
27       Gordon Reid     Florida      4614.16
28     Alonzo Hansen       Texas      4603.20
29     Howard Chacon     Florida      4499.92
30      Blake Newman       Texas      4458.72
31    George Hubbard     Florida      3824.24
32  Babette Crutcher     Florida      3446.45
33     Andrea Bailey     Florida      3397.94
34        Sonny Goad       Texas      3310.44
35      Megan Hudson  California      3153.15

## 09. Qual o nome do cliente que fez a compra de Receita mais alta e qual funcionário fez o atendimento?

In [30]:
query = """
SELECT
    ec.client_name AS nome_cliente,
    MAX(es.revenue) AS receita_mais_alta,
    CONCAT(es2.first_name, ' ', es2.last_name) AS nome_funcionario
FROM
    ada.employees_sales AS es
JOIN
    ada.employees_clients AS ec
ON
	es.client_id = ec.client_id
JOIN
    ada.employees_status AS es2
ON
	es.employee_id = es2.employee_id
WHERE
    es.revenue = (
		SELECT MAX(revenue) 
		FROM ada.employees_sales)
GROUP BY
    nome_cliente,
	nome_funcionario;
"""

pd.read_sql_query(query, con = conn)

         nome_cliente  receita_mais_alta  nome_funcionario
0  Ebony Vandermeulen           579832.5  Mikaela Cummings

## 10. Qual funcionário teve a maior quantidade de vendas e qual a Receita?

In [31]:
query = """
SELECT
    CONCAT(es.first_name, ' ', es.last_name) AS nome_completo,
    eas.qty_sales AS quantidade_vendas,
    eas.revenue AS receita
FROM
    ada.employees_status AS es
JOIN
    ada.employees_sales AS eas
ON
	es.employee_id = eas.employee_id
ORDER BY
    quantidade_vendas DESC,
	receita DESC
LIMIT 1;
"""

pd.read_sql_query(query, con = conn)

  nome_completo  quantidade_vendas   receita
0    Neva Sykes                106  325162.5